# ExportLinetypeKey Constructor (ExportLinetypeKey) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeKey Constructor (ExportLinetypeKey)
ExportLinetypeKey Class See Also
---
Constructs a new copy of the input ExportLinetypeKey object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLinetypeKey(
	ExportLinetypeKey other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ExportLinetypeKey _
)
```

Visual C++
---
```text
public:
ExportLinetypeKey(
	ExportLinetypeKey^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ExportLinetypeKey
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLinetypeKey Class
ExportLinetypeKey Overload
Autodesk.Revit.DB Namespace